app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "poster", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    saved_movie = Movie.find_by_imdbID(params[:imdbID])
    if saved_movie == nil
      movie = Movie.new(movie_params)

      if movie.save