app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 2]]
---
  def reviews
    render json: {reviews: Movie.find(params[:id]).reviews}

SELECT "movies".* FROM "movies"
---
  def index
    render json: {movies: Movie.all}

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: {movie: Movie.find(params[:id])}