app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 3]]
---
  def destroy
    review = Review.find(params[:id])

    review.destroy