app/controllers/reviews_controller.rb

  def get_all
    render json: {users: User.all, movies: Movie.all, reviews: Review.all}
---
SELECT "movies".* FROM "movies"
SELECT "reviews".* FROM "reviews"
SELECT "users".* FROM "users"

  def index
    render json: Review.all
---
SELECT "reviews".* FROM "reviews"

  def show
    render json: Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    review = Review.new(review_params)

    if review.save
---
INSERT INTO "reviews" ("title", "rating", "comments", "user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    review = Review.find(params[:id])

    if review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = $1, "rating" = $2, "comments" = $3, "updated_at" = $4 WHERE "reviews"."id" = $5  [["title", "Edit: This Movie is Terrible"], ["rating", "2"], ["comments", "I was too harsh before"], ["updated_at", 2017-03-02 16:01:47 UTC], ["id", 3]]