app/controllers/users_controller.rb

  def reviews
    render json: {reviews: User.find(params[:id]).reviews}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]

  def create
    user = User.new(user_params)
    if user.save && user.authenticate(params[:user][:password])
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "a@a.com"], ["password_digest", "$2a$10$cBNQA2dDH3uaIz3obbw3JO.oydMP.KjtMlFwxVQMk9btJZDZBxplO"], ["created_at", 2017-03-02 04:25:46 UTC], ["updated_at", 2017-03-02 04:25:46 UTC]]

  def login
    if params[:user][:email_username].include? "@"
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ThatMattDude"], ["LIMIT", 1]]